In [1]:
# 라이브러리 불러오기
import seaborn as sns
import pandas as pd

# titanic 데이터셋에서 age, fare 2개 열을 선택하여 데이터프레임 만들기

titanic = sns.load_dataset('titanic')
df = titanic.loc[:, ['age','fare']]

# 사용자 함수 정의
def add_10(n):   
    return n + 10

def add_two_obj(a, b):    
    return a + b
    
# 데이터프레임의 모든 원소를 add_10() 함수에 매핑
df_map = df.map(add_10)   
df_map.head()

    age     fare
0  32.0  17.2500
1  48.0  81.2833
2  36.0  17.9250
3  45.0  63.1000
4  45.0  18.0500

In [2]:
# 람다 함수 활용
df2 = df.map(lambda n: n + 10)  
df2.head()

    age     fare
0  32.0  17.2500
1  48.0  81.2833
2  36.0  17.9250
3  45.0  63.1000
4  45.0  18.0500

In [3]:
# 함수의 매개변수가 2개 이상인 경우 
df3 = df.map(add_two_obj, b=10)
df3.head()

    age     fare
0  32.0  17.2500
1  48.0  81.2833
2  36.0  17.9250
3  45.0  63.1000
4  45.0  18.0500

In [4]:
# 함수의 매개변수가 2개 이상인 경우 (람다 함수 활용)
df4 = df.map(lambda a, b: a + b, b=10)
df4.head()

    age     fare
0  32.0  17.2500
1  48.0  81.2833
2  36.0  17.9250
3  45.0  63.1000
4  45.0  18.0500